# Actividad 1

1. Descargue e Instale algún manejador de bases de datos. (Les recomiendo DB Browser for SQLite, pero pueden instalarse cualquiera de los vistos en la clase).
Link: https://sqlitebrowser.org/dl/

2. Abra el programa: por ejemplo, el DB Browser for SQLite.\
    a. Presionar en el botón Nueva base de datos.\
    b. Colocar un nombre de su primer base de datos y guárdelo en una carpeta de la primera clase. Por ejemplo, colcar el nombre: “miprimerabase”. El archivo será miprimerabase.db\
    c. A continuación, aparecerá una nueva ventana. La misma sirve para crear tablas.\
    d. Ahora presione donde dice Añadir.\
    e. Coloque su nombre en el campo vacío.\
    f. A continuación, en la primera celda de la columna Nombre remplace “Field1” y colóquele dni, ese nombre será una columna de su tabla.\
    g. Además, elija dentro de las opciones del Tipo, el valor INTEGER.\
    h. A continuación, presione en Aceptar.

    ENVÍE UNA CAPTURA COMO LA QUE APARECE EN LA IMAGEN, EN DONDE SE VEA LA TABLA CON SU NOMBRE Y LA COLUMNA dni.

3. Revise las pestañas: Estructura y Ejecutar SQL. Ambas son muy importantes para ejecutar código y visualizar los datos.

Presione Control + S, para guardar cambios en la BD. Puede cerrar el programa.

Archivo del enunciado: <a href="Enunciados\Actividad 1.pdf">Actividad 1</a>

## Captura

<img src="img\RActividad1.jpg">

# Actividad 2

1. Genere una base de datos, colóquele un nombre y guárdelo. Luego agregue las siguientes tablas: (utilice el código que se les proporciona)\
    Para crear las tablas, abra el archivo tablas.txt y para cada bloque de código copie y péguelo en el espacio de consultas SQL y ejecútelo.

2. Escriba 4 consultas (sentencias) de SQL distintas utilizando SELECT, FROM y WHERE.

3. Guarde las consultas en un archivo txt y súbalo publíquelo en el foro.

Archivo del enunciado: <a href="Enunciados\Actividad 2.pdf">Actividad 2</a>

## Código Proporcionado

In [ ]:
CREATE TABLE Alumno (
  idAlumno INT PRIMARY KEY,
  nombre VARCHAR(50),
  apellido VARCHAR(50),
  fechaNacimiento DATE,
  direccion VARCHAR(100),
  telefono VARCHAR(20)
);


CREATE TABLE Curso (
  idCurso INT PRIMARY KEY,
  nombre VARCHAR(100),
  descripcion TEXT,
  fechaInicio DATE,
  fechaFin DATE
);


CREATE TABLE Inscripcion (
  idInscripcion INT PRIMARY KEY,
  idAlumno INT,
  idCurso INT,
  fechaInscripcion DATE,
  FOREIGN KEY (idAlumno) REFERENCES Alumno(idAlumno),
  FOREIGN KEY (idCurso) REFERENCES Curso(idCurso)
);

## Sentencias SQL

In [ ]:
SELECT * FROM Alumno;

SELECT nombre, descripcion, fechaInicio FROM Curso;

SELECT descripcion, fechaInicio, fechaFin FROM Curso WHERE nombre = "Python";

SELECT direccion, telefono FROM Alumno WHERE nombre = "S%" AND apellido = "B%";

# Actividad 3

1. Supongamos que tenemos una tabla llamada "empleados" con las siguientes columnas: "nombre", "apellido", "edad" y "salario". Escribe una consulta que seleccione el nombre y apellido de los empleados y les asigne los alias "Nombre" y "Apellido" respectivamente.

2. Supongamos que tenemos una tabla llamada "productos" con las siguientes columnas: "id", "nombre", "precio" y "stock". Escribe una consulta que seleccione todos los registros de la tabla y muestre todas las columnas.

3. Supongamos que tenemos una tabla llamada "ventas" con las siguientes columnas: "id", "fecha", "producto_id" y "cantidad". Escribe una consulta que seleccione todos los registros de la tabla y muestre todas las columnas, asignando un alias al nombre de la columna "producto_id" llamado "ID de producto".

Archivo del enunciado: <a href="Enunciados\Actividad 3.pdf">Actividad 3</a>

## Sentencias SQL

In [ ]:
SELECT nombre AS Nombre, apellido AS Apellido FROM empleados;

SELECT * FROM productos;

SELECT id, fecha, producto_id AS "ID de producto", cantidad FROM ventas

# Actividad 4

Crear una base de datos vacía. Copie el texto que está en el archivo tablas.txt y péguelo en la sección de ejecución de código sql dentro del programa. Ejecútelo.

A continuación, realice los siguientes puntos y verifique sus resultados en
el programa.

1. Obtener una lista de los nombres únicos de los clientes en orden
alfabético.
2. Obtener los tres productos más caros de una tabla de productos:
3. Obtener los cinco pedidos más recientes.

Archivo del enunciado: <a href="Enunciados\Actividad 4.pdf">Actividad 4</a>

## Código Proporcionado

In [ ]:
--Tabla Clientes

CREATE TABLE Clientes (
  id INT PRIMARY KEY,
  nombre VARCHAR(50),
  apellido VARCHAR(50),
  direccion VARCHAR(100),
  telefono VARCHAR(15)
);

INSERT INTO Clientes (id, nombre, apellido, direccion, telefono) VALUES
(1, 'Juan', 'Perez', 'Calle 123', '1234567890'),
(2, 'María', ' García', 'Avenida 456', '0987654321'),
(3, 'Pedro', 'Sanchez', 'Plaza 789', '5555555555'),
(4, 'Laura', 'Martinez', 'Carrera 321', '7777777777'),
(5, 'Ana', 'Rodríguez', 'Paseo 654', '3333333333'),
(6, 'Carlos', 'López', 'Boulevard 987', '4444444444'),
(7, 'Sofía', 'Torres', 'Camino 876', '6666666666'),
(8, 'Luisa', 'Vargas', 'Ruta 543', '2222222222'),
(9, 'Jorge', 'Ríos', 'Sendero 987', '9999999999'),
(10, 'Marta', 'Ramirez', 'Autopista 654', '1111111111'),
(11, 'María', 'Vivas', 'Paseo 111', '1357924680'),
(12, 'Ana', 'García', 'Plaza 999', '9878767654'),
(13, 'Pedro', 'Amarilla', 'Camino 333', '1357924680'),
(14, 'David', 'Godoy', 'Avenida 55', '2213324431');


--Tabla Productos

CREATE TABLE Productos (
  id INT PRIMARY KEY,
  nombre VARCHAR(50),
  precio DECIMAL(8,2),
  stock INT
);

INSERT INTO Productos (id, nombre, precio, stock) VALUES
(1, 'Camiseta', 19.99, 50),
(2, 'Pantalón', 29.99, 30),
(3, 'Zapatos', 49.99, 20),
(4, 'Bolso', 39.99, 15),
(5, 'Sombrero', 14.99, 40),
(6, 'Bufanda', 9.99, 60),
(7, 'Guantes', 7.99, 25),
(8, 'Bermuda', 24.99, 10),
(9, 'Abrigo', 99.99, 5),
(10, 'Calza', 12.99, 35);


--Tabla Pedidos

CREATE TABLE Pedidos (
  id INT PRIMARY KEY,
  cliente_id INT,
  producto_id INT,
  cantidad INT,
  fecha_pedido DATE
);

INSERT INTO Pedidos (id, cliente_id, producto_id, cantidad, fecha_pedido) VALUES
(1, 2, 3, 2, '2023-05-01'),
(2, 5, 7, 1, '2023-05-02'),
(3, 3, 1, 3, '2023-05-03'),
(4, 14, 3, 1, '2023-05-04'),
(5, 4, 6, 2, '2023-05-04'),
(6, 1, 2, 1, '2023-05-05'),
(7, 6, 9, 1, '2023-05-06'),
(8, 9, 5, 2, '2023-05-07'),
(9, 10, 8, 1, '2023-05-07'),
(10, 12, 10, 3, '2023-05-10'),
(11, 11, 2, 1, '2023-05-11'),
(12, 7, 9, 1, '2023-05-12'),
(13, 8, 5, 2, '2023-05-12'),
(14, 12, 8, 1, '2023-05-14'),
(15, 13, 6, 1, '2023-05-16');

## Sentencias SQL

In [ ]:
SELECT DISTINCT nombre FROM Clientes ORDER BY nombre ASC;

SELECT nombre, precio FROM Productos ORDER BY precio DESC LIMIT 3;

SELECT * FROM Pedidos ORDER BY fecha_pedido DESC LIMIT 5;

# Actividad 5

Crear una base de datos vacía. Copie el texto que está en el archivo base.txt y péguelo en la sección de ejecución de código sql dentro del programa. Ejecútelo.

A continuación, realice los siguientes puntos y verifique sus resultados en el programa.
1. Obtener una lista de los empleados que se llaman “Adrián”.
2. Obtener una lista de los empleados que su nombre contiene “Juan”.
3. Devolver una lista con el nombre de los departamentos que tienen
un presupuesto entre 100000 y 200000 dólares.
4. Devolver una lista con el nombre de los departamentos de aquellos
que tienen menos de 5000 dolares de gastos.

Archivo del enunciado: <a href="Enunciados\Actividad 5.pdf">Actividad 5</a>

## Código Proporcionado

In [ ]:
CREATE TABLE departamento (
  id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
  nombre VARCHAR(100) NOT NULL,
  presupuesto DOUBLE UNSIGNED NOT NULL,
  gastos DOUBLE UNSIGNED NOT NULL
);

CREATE TABLE empleado (
  id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
  nif VARCHAR(9) NOT NULL UNIQUE,
  nombre VARCHAR(100) NOT NULL,
  apellido1 VARCHAR(100) NOT NULL,
  apellido2 VARCHAR(100),
  id_departamento INT UNSIGNED,
  FOREIGN KEY (id_departamento) REFERENCES departamento(id)
);

INSERT INTO departamento VALUES(1, 'Desarrollo', 120000, 6000);
INSERT INTO departamento VALUES(2, 'Sistemas', 150000, 21000);
INSERT INTO departamento VALUES(3, 'Recursos Humanos', 280000, 25000);
INSERT INTO departamento VALUES(4, 'Contabilidad', 110000, 3000);
INSERT INTO departamento VALUES(5, 'I+D', 375000, 380000);
INSERT INTO departamento VALUES(6, 'Proyectos', 0, 0);
INSERT INTO departamento VALUES(7, 'Publicidad', 0, 1000);

INSERT INTO empleado VALUES(1, '32481596F', 'Aarón', 'Rivero', 'Gómez', 1);
INSERT INTO empleado VALUES(2, 'Y5575632D', 'Adela', 'Salas', 'Díaz', 2);
INSERT INTO empleado VALUES(3, 'R6970642B', 'Adolfo', 'Rubio', 'Flores', 3);
INSERT INTO empleado VALUES(4, '77705545E', 'Adrián', 'Suárez', NULL, 4);
INSERT INTO empleado VALUES(5, '17087203C', 'Marcos', 'Loyola', 'Méndez', 5);
INSERT INTO empleado VALUES(6, '38382980M', 'María', 'Santana', 'Moreno', 1);
INSERT INTO empleado VALUES(7, '80576669X', 'Pilar', 'Ruiz', NULL, 2);
INSERT INTO empleado VALUES(8, '71651431Z', 'Pepe', 'Ruiz', 'Santana', 3);
INSERT INTO empleado VALUES(9, '56399183D', 'Juan', 'Gómez', 'López', 2);
INSERT INTO empleado VALUES(10, '46384486H', 'Diego','Flores', 'Salas', 5);
INSERT INTO empleado VALUES(11, '67389283A', 'Marta','Herrera', 'Gil', 1);
INSERT INTO empleado VALUES(12, '41234836R', 'Irene','Salas', 'Flores', NULL);
INSERT INTO empleado VALUES(13, '82635162B', 'Juan Antonio','Sáez', 'Guerrero', NULL);
INSERT INTO empleado VALUES(14, '32399183F', 'Adrián', 'Gómez', 'Calvo', 2);

## Sentencias SQL

In [ ]:
SELECT * FROM empleado WHERE nombre like "Adrián%";

SELECT * FROM empleado WHERE nombre like "%Juan%";

SELECT nombre FROM departamento WHERE presupuesto BETWEEN 100000 AND 200000;

SELECT nombre FROM departamento WHERE gastos < 5000;

# Actividad 6

Crear una base de datos vacía. Copie el texto que está en el archivo tablas.txt y péguelo en la sección de ejecución de código sql dentro del programa. Ejecútelo.

A continuación, realice los siguientes puntos y verifique sus resultados en el programa.
1. Obtener los pedidos realizados por cada cliente y su información.
2. Obtener todos los clientes y sus pedidos (si los tienen).
3. Obtener todos los pedidos y los clientes correspondientes (si existen).

En las 3 consultas debe devolver: nombre del cliente, id del pedido, producto y cantidad.

Archivo del enunciado: <a href="Enunciados\Actividad 6.pdf">Actividad 6</a>

## Código Proporcionado

In [ ]:
-- Tabla "Clientes"
CREATE TABLE Clientes (
  id_cliente INT PRIMARY KEY,
  nombre VARCHAR(50),
  direccion VARCHAR(100)
);

-- Tabla "Pedidos"
CREATE TABLE Pedidos (
  id_pedido INT PRIMARY KEY,
  id_cliente INT,
  producto VARCHAR(50),
  cantidad INT,
  FOREIGN KEY (id_cliente) REFERENCES Clientes(id_cliente)
);

## Sentencias SQL

In [ ]:
# Punto 1:
SELECT C.nombre, P.id_pedido, P.producto, P.cantidad
FROM Clientes C
INNER JOIN Pedidos P ON C.id_cliente = P.id_cliente;

# Punto 2:
SELECT C.nombre, P.id_pedido, P.producto, P.cantidad
FROM Clientes C
LEFT JOIN Pedidos P ON C.id_cliente = P.id_cliente;

# Punto 3:
SELECT C.nombre, P.id_pedido, P.producto, P.cantidad
FROM Clientes C
RIGHT JOIN Pedidos P ON C.id_cliente = P.id_cliente;

# Actividad 7

Crear una base de datos vacía. Copie el texto que está en el archivo tablas.txt y péguelo en la sección de ejecución de código sql dentro del programa. Ejecútelo.

A continuación, realice los siguientes puntos y verifique sus resultados en el programa.
1. Contar el número de clientes.
2. Calcular el total de ventas en la tabla "Pedidos”.
3. Calcular el promedio de edades de los clientes.
4. Obtener el pedido de mayor valor.
5. Obtener el pedido de menor valor.

Archivo del enunciado: <a href="Enunciados\Actividad 7.pdf">Actividad 7</a>

## Código Proporcionado

In [ ]:
-- Crear la tabla "Clientes"
CREATE TABLE Clientes (
  ID INT PRIMARY KEY,
  Nombre VARCHAR(50),
  Edad INT,
  Puntaje INT
);

-- Insertar datos en la tabla "Clientes"
INSERT INTO Clientes (ID, Nombre, Edad, Puntaje) VALUES
(1, 'Juan', 25, 220),
(2, 'María', 30, 289),
(3, 'Pedro', 35, 199),
(4, 'Laura', 28, 101),
(5, 'Carlos', 32, 290),
(6, 'Juan Carlos', 28, 112),
(7, 'Mariana', 20, 89),
(8, 'Luis', 25, 99),
(9, 'Sofía', 38, 198),
(10, 'Agustín', 22, 210),
(11, 'Sebastián', 25, 180),
(12, 'María', 30, 91),
(13, 'Pedro', 35, 93),
(14, 'Juan', 22, 89),
(15, 'Kevin', 28, 170);

-- Crear la tabla "Pedidos"
CREATE TABLE Pedidos (
  ID INT PRIMARY KEY,
  ClienteID INT,
  Total DECIMAL(10, 2),
  Cantidad_productos INT
);

-- Insertar datos en la tabla "Pedidos"
INSERT INTO Pedidos (ID, ClienteID, Total, Cantidad_productos) VALUES
(1, 1, 100.50, 2),
(2, 1, 75.20, 4),
(3, 2, 50.00, 1),
(4, 3, 200.75, 2),
(5, 4, 150.90, 3),
(6, 7, 70.90, 2),
(7, 12, 100.00, 2),
(8, 2, 120.25, 1),
(9, 14, 50.90, 3),
(10, 9, 150.00, 1);

## Sentencias SQL

In [ ]:
#Punto 1:
SELECT count(*) FROM Clientes

#Punto 2:
SELECT sum(total) FROM Pedidos

#Punto3:
SELECT avg(Edad) FROM Clientes

#Punto 4:
SELECT max(total) FROM Pedidos

#Punto 5:
SELECT min(total) FROM Pedidos

# Actividad 8

Crear una base de datos vacía. Copie el texto que está en el archivo tablas.txt y péguelo en la sección de ejecución de código sql dentro del programa. Ejecútelo.

A continuación, realice los siguientes puntos y verifique sus resultados en el programa.

Group by
1. Obtener la cantidad de alumnos por curso.
2. Calcular el promedio de edad de los alumnos por curso.
3. Obtener el curso con la mayor cantidad de alumnos (Difícil).

Having
1. Obtener los cursos con más de 3 alumnos inscritos.
2. Calcular el promedio de edad de los alumnos por curso y mostrar solo los cursos con un promedio de edad superior a 19.
3. Obtener los cursos cuyo profesor sea "Profesor B" y que tengan al menos 2 alumnos inscritos (Difícil).

Archivo del enunciado: <a href="Enunciados\Actividad 8.pdf">Actividad 8</a>

## Código Proporcionado

In [ ]:
-- Crear la tabla Alumnos
CREATE TABLE Alumnos (
    id INT PRIMARY KEY,
    nombre VARCHAR(50),
    edad INT,
    curso_id INT
);

-- Insertar registros en la tabla Alumnos
INSERT INTO Alumnos (id, nombre, edad, curso_id)
VALUES
    (1, 'Juan', 18, 1),
    (2, 'María', 19, 2),
    (3, 'Pedro', 18, 1),
    (4, 'Laura', 20, 3),
    (5, 'Carlos', 19, 2),
    (6, 'Ana', 18, 1),
    (7, 'Luis', 19, 3),
    (8, 'Marta', 20, 2),
    (9, 'David', 18, 1),
    (10, 'Sofía', 19, 2);

-- Crear la tabla Cursos
CREATE TABLE Cursos (
    id INT PRIMARY KEY,
    nombre VARCHAR(50),
    profesor VARCHAR(50)
);

-- Insertar registros en la tabla Cursos
INSERT INTO Cursos (id, nombre, profesor)
VALUES
    (1, 'Matemáticas', 'Profesor A'),
    (2, 'Historia', 'Profesor B'),
    (3, 'Inglés', 'Profesor C');

## Sentencias SQL

In [ ]:
#GROUP BY:
#Punto 1:
SELECT curso_id, count(*)
FROM Alumnos
GROUP BY curso_id;

#Punto 2:
SELECT curso_id, avg(edad)
FROM Alumnos
GROUP BY curso_id;

#Punto 3:
SELECT curso_id, count(*) as CantAlumnos
FROM Alumnos A
GROUP BY curso_id
ORDER BY CantAlumnos DESC LIMIT 1;

#HAVING:
#Punto 1:
SELECT curso_id, count(*) as CantAlumnos
FROM Alumnos
GROUP BY curso_id HAVING CantAlumnos > 3;

#Punto 2:
SELECT curso_id, avg(edad) as PromEdad
FROM Alumnos
GROUP BY curso_id HAVING PromEdad > 19;

#Punto 3:
SELECT curso_id, C.nombre
FROM Alumnos A
INNER JOIN Cursos C ON A.curso_id = C.id
GROUP BY curso_id HAVING (count(*) >= 2 AND C.profesor like "Profesor B")